[
  {
    "title": "[CAP] Promote Estimate to Workorder",
    "labels": [
      "type : capability",
      "layer : business",
      "domain : workexec"
    ],
    "body": "    /kiro\n    Decompose this capability into minimal, testable stories and ensure audit-safe boundaries.\n\n    # Capability Definition\n\n    ## Classification (confirm labels)\n    - Type: capability\n    - Layer: business\n    - Domain: workexec\n\n    ## Description\n    The system must convert an approved (or partially approved) estimate into a workorder suitable for execution, preserving approved scope, pricing snapshots, taxes, and customer authorization artifacts.\n\nPromotion is the control point where planned work becomes executable work, and it must prevent scope/price drift.\n\n    ## Business Rules\n    - Only approved estimates (or approved scope of partially approved estimates) may be promoted\n- Promotion creates a new Workorder record with a link to the originating estimate version and approval record\n- Workorder line items must reflect approved scope; unapproved items are excluded or marked as not-authorized\n- Promotion must preserve pricing/tax snapshot used for approval (or record a clear rationale if recalculated)\n- Promotion must be idempotent (retries do not create duplicate workorders)\n\n    ## Inputs\n    - Approved estimate (versioned) and approved scope\n- Approval artifacts/record\n- Operational parameters (shop location, preferred technician/crew, scheduling preferences)\n\n    ## Outputs\n    - Workorder with initial status (e.g., Draft/Ready/InProgress depending on workflow)\n- Workorder line items generated from approved estimate items\n- Linkage: workorder ↔ estimate version ↔ approval record\n- Execution-ready pricing visibility rules applied by role\n\n    ## Edge Cases\n    - Partially approved estimates (promote only approved items)\n- Multiple approvals across revisions (promote the latest valid approval only)\n- Approval expired (block promotion)\n- Estimate promoted once already (idempotency)\n\n    ## Acceptance Criteria\n    - Promotion creates a single workorder tied to the approved estimate version\n- Workorder items match approved scope (quantities/prices/taxes)\n- Promotion blocks if approval is missing/invalid/expired\n- Promotion produces an audit trail of what was promoted and why\n- Users can see origin links between workorder and estimate/approval\n\n    ## Decomposes Into (Stories)\n    - [ ] Story: Validate Promotion Preconditions\n  - Details: Before promotion, verify estimate status, approval validity (not expired), approved scope presence, and estimate version linkage; surface actionable errors.\n- [ ] Story: Create Workorder from Approved Estimate\n  - Details: Create a workorder header with customer/vehicle context, link to estimate version and approval record, and set initial workorder state.\n- [ ] Story: Generate Workorder Items from Approved Scope\n  - Details: Create workorder items for parts and labor based on approved line items; preserve identifiers, quantities, pricing, and tax snapshot fields.\n- [ ] Story: Enforce Idempotent Promotion\n  - Details: If promotion is retried (network failure, double-click), ensure the system returns the existing workorder rather than duplicating.\n- [ ] Story: Handle Partial Approval Promotion\n  - Details: Promote only the explicitly approved items; keep unapproved items available for future approval/re-promotion without contaminating the workorder.\n- [ ] Story: Record Promotion Audit Trail\n  - Details: Persist an audit event capturing who promoted, when, which estimate version, and a summary of items promoted (counts/totals) for traceability.\n\n    ## Notes for Agents\n    Promotion is the hinge of quote-to-cash—prioritize auditability and idempotency.\nPreserve approved pricing/tax snapshot; if recalculation is required, record rationale and require re-approval.\nKeep workorder executable even if estimate lifecycle continues (e.g., optional items approved later).\n"
  },
  {
    "title": "[CAP] Execute Workorder (Parts & Labor)",
    "labels": [
      "type : capability",
      "layer : business",
      "domain : workexec"
    ],
    "body": "    /kiro\n    Decompose this capability into minimal, testable stories and ensure audit-safe boundaries.\n\n    # Capability Definition\n\n    ## Classification (confirm labels)\n    - Type: capability\n    - Layer: business\n    - Domain: workexec\n\n    ## Description\n    The system must support day-to-day execution of a workorder by technicians and staff, including assigning technicians, recording labor, issuing/consuming parts, and tracking work progress.\n\nExecution must support controlled changes while preserving role-based visibility (e.g., hiding prices from mechanics).\n\n    ## Business Rules\n    - Workorder must be in an executable state to start (e.g., Ready/InProgress)\n- Technician assignment may be required before labor can be recorded\n- Parts consumption must be recorded against workorder items; substitutions must be tracked\n- Prices/costs visibility is role-based (mechanic may not see prices; back office can)\n- Additions/changes that alter scope or total may require customer re-approval (handled via approval capability)\n\n    ## Inputs\n    - Workorder and items (parts, labor)\n- Technician/crew assignments and time tracking inputs\n- Parts issuance/consumption events (pick, install, return)\n- Notes, photos, measurements (optional)\n\n    ## Outputs\n    - Updated workorder status/progress\n- Labor entries (time, flat-rate completion, notes)\n- Parts usage records (quantity consumed, substitutions, returns)\n- Change requests requiring approval (if scope changes)\n\n    ## Edge Cases\n    - Substitute part used due to availability; impacts price/tax\n- Partial completion across multiple days/technicians\n- Additional work discovered mid-job requiring approval\n- Returned or unused parts after initial consumption\n- Mechanic operates offline; sync later\n\n    ## Acceptance Criteria\n    - Technicians can view assigned workorders with required execution details\n- Labor and parts activity can be recorded and audited\n- Role-based visibility hides sensitive pricing where configured\n- Workorder progress and status reflect execution reality\n- Changes that require approval are flagged and gated appropriately\n\n    ## Decomposes Into (Stories)\n    - [ ] Story: Assign Technician to Workorder\n  - Details: Assign a primary technician/crew; optionally allow reassignment; record assignment history and timestamps.\n- [ ] Story: Start Workorder and Track Status\n  - Details: Transition workorder into InProgress with validation; track status updates (waiting parts, waiting approval, etc.) as configured.\n- [ ] Story: Record Labor Performed\n  - Details: Capture labor entries by service line: hours, rate class, completion flags, notes; support flat-rate and time-based labor.\n- [ ] Story: Issue and Consume Parts\n  - Details: Record parts issued/installed/consumed against workorder items; track lot/serial where applicable; support partial consumption.\n- [ ] Story: Handle Part Substitutions and Returns\n  - Details: Allow substituting a part (with trace to original item) and returning unused parts; ensure quantity integrity and audit trail.\n- [ ] Story: Request Additional Work and Flag for Approval\n  - Details: When new parts/labor are added or scope changes, create a change request requiring customer approval before continuing billable work.\n- [ ] Story: Apply Role-Based Visibility in Execution UI\n  - Details: Ensure mechanics/technicians do not see configured hidden price fields while back office retains full financial data access.\n\n    ## Notes for Agents\n    Execution is where flexibility meets control—ensure the model supports real shop workflows without enabling revenue leakage.\nKeep financial truth (prices/taxes) present in data even if hidden in the UI for certain roles.\nTreat additional-work requests as an approval-triggering pathway, not an ad-hoc edit.\n"
  },
  {
    "title": "[CAP] Complete Workorder",
    "labels": [
      "type : capability",
      "layer : business",
      "domain : workexec"
    ],
    "body": "    /kiro\n    Decompose this capability into minimal, testable stories and ensure audit-safe boundaries.\n\n    # Capability Definition\n\n    ## Classification (confirm labels)\n    - Type: capability\n    - Layer: business\n    - Domain: workexec\n\n    ## Description\n    The system must support closing out execution, confirming all work is completed, reconciling parts and labor records, and preparing the workorder for invoicing.\n\nCompletion is the validation gate that ensures the invoice will be accurate and defensible.\n\n    ## Business Rules\n    - Workorder can only be completed if required execution fields are satisfied (configurable)\n- All approval-gated change requests must be resolved before completion\n- Parts and labor must be reconciled (no negative quantities; required services completed)\n- Completion captures a final execution snapshot and locks billable scope (unless reopened with permissions)\n- Completion records who completed and when\n\n    ## Inputs\n    - Workorder execution records (labor entries, parts usage, notes)\n- Outstanding change requests and approvals\n- Quality checks / inspection results (optional)\n\n    ## Outputs\n    - Workorder state transition to Completed\n- Finalized billable scope snapshot for invoicing\n- Completion checklist/audit record\n\n    ## Edge Cases\n    - Workorder partially completed and paused; completion attempted prematurely\n- Pending approvals for added work block completion\n- Parts shortages result in incomplete tasks\n- Reopen completed workorder (with audit)\n\n    ## Acceptance Criteria\n    - System prevents completion when required conditions are not met\n- Completion locks billable scope for invoice generation\n- Completion produces an audit record and summary totals\n- Reopen workflow (if enabled) records justification and user\n\n    ## Decomposes Into (Stories)\n    - [ ] Story: Validate Completion Preconditions\n  - Details: Validate that required services are marked complete, parts usage is reconciled, and approvals are resolved; present a clear completion checklist.\n- [ ] Story: Resolve Approval-Gated Change Requests\n  - Details: Block completion until all approval-required changes are approved/rejected and the workorder items reflect the approved outcome.\n- [ ] Story: Finalize Billable Scope Snapshot\n  - Details: Create a snapshot of parts and labor that will be invoiced, including taxes/fees basis; mark items as invoice-ready.\n- [ ] Story: Complete Workorder and Record Audit\n  - Details: Transition to Completed; record who/when; store completion notes and any inspection outcomes.\n- [ ] Story: Reopen Completed Workorder (Controlled)\n  - Details: Allow authorized users to reopen a completed workorder, capturing reason, user, timestamp, and impact on invoice readiness.\n\n    ## Notes for Agents\n    Completion should be a strong validation gate; it prevents downstream invoice errors and disputes.\nKeep completion checks configurable by shop policy, but always maintain audit evidence of completion.\nIf reopening is supported, treat it as an exception workflow with strict audit.\n"
  },
  {
    "title": "[CAP] Convert Workorder to Invoice",
    "labels": [
      "type : capability",
      "layer : business",
      "domain : workexec"
    ],
    "body": "    /kiro\n    Decompose this capability into minimal, testable stories and ensure audit-safe boundaries.\n\n    # Capability Definition\n\n    ## Classification (confirm labels)\n    - Type: capability\n    - Layer: business\n    - Domain: workexec\n\n    ## Description\n    The system must generate an invoice from a completed workorder, ensuring all billable parts and labor are included, taxes are applied correctly, and the invoice reflects the approved and performed scope.\n\nThis is the final step that produces the customer-facing financial document and anchors quote-to-cash completion.\n\n    ## Business Rules\n    - Only Completed workorders (or invoice-ready state) may be invoiced\n- Invoice line items are derived from the finalized billable scope snapshot\n- Taxes and fees must be computed consistently and transparently\n- Invoice must preserve references to originating estimate and approvals for dispute resolution\n- If adjustments are made at invoicing, they must be authorized and auditable\n\n    ## Inputs\n    - Completed workorder and billable scope snapshot\n- Tax configuration and exemption data\n- Customer billing preferences (email/print, PO number, terms)\n\n    ## Outputs\n    - Invoice (header and line items)\n- Invoice totals (subtotal, taxes, fees, total due)\n- Linkage: invoice ↔ workorder ↔ estimate/approval\n- Invoice audit record (created by/when; adjustments)\n\n    ## Edge Cases\n    - Mixed-tax invoice (taxable labor, non-taxable fees, exemptions)\n- Rounding differences between estimate and invoice (must be explainable)\n- Partial invoicing (if supported)\n- Discounts applied at invoice time vs estimate time\n\n    ## Acceptance Criteria\n    - Invoice is generated from completed workorder with all billable items present\n- Taxes and totals are accurate for mixed-tax scenarios\n- Invoice references workorder and estimate/approval trail\n- Authorized adjustments are recorded with reason and user\n- Invoice is ready for downstream AR processing (out of scope here, but structurally complete)\n\n    ## Decomposes Into (Stories)\n    - [ ] Story: Generate Invoice Draft from Completed Workorder\n  - Details: Create a draft invoice from the finalized billable scope snapshot; include customer, vehicle, and workorder references.\n- [ ] Story: Calculate Taxes, Fees, and Totals on Invoice\n  - Details: Compute taxes/fees and totals at invoice time using configured rules; ensure consistency with estimate snapshot or document variance.\n- [ ] Story: Preserve Traceability Links (Estimate/Approval/Workorder)\n  - Details: Ensure invoice records link back to workorder, estimate version, and approval artifacts for audit and disputes.\n- [ ] Story: Support Authorized Invoice Adjustments\n  - Details: Allow authorized users to adjust invoice lines (discounts, goodwill) with mandatory reason codes and audit trail.\n- [ ] Story: Finalize and Issue Invoice\n  - Details: Transition invoice to Issued/Posted (depending on workflow); lock invoice lines; record issuer and timestamp; prepare for delivery (email/print) and AR handoff.\n\n    ## Notes for Agents\n    The invoice is the financial truth delivered to the customer—protect integrity and traceability.\nIf totals differ from the estimate, capture why (additional approved work, substitutions, tax rounding).\nKeep the capability focused on invoice creation/issuance; payment and GL posting remain separate domains.\n"
  }
]